
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11879196783)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 17 to change, 5 to destroy.</code></pre>

* Update
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/pull_request_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/release.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/workflows/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "17c94619aa9e564db68be9ab2214dd5cf8b9d016" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "6bd0dbe55e6f3b2cb7dd956cac5619ba7f4daf29" -> (known after apply)
      ~ id                    = "hayas1:devcontainer-features:44" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 44 -> (known after apply)
      ~ opened_at             = 1731847560 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847574 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "dyson-rs/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d94a2b4dc8f49e29b32e8c7e9f43c3b58667fa8e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "bc1cb325f5d81be989c2fa18a521f93c17762884" -> (known after apply)
      ~ id                    = "hayas1:dyson-rs:12" -> (known after apply)
      ~ labels                = [
          - "documentation",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 12 -> (known after apply)
      ~ opened_at             = 1731847646 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847658 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/pull_request_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/release.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/workflows/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "5cc937a63844a086691695303161c7ae382336d9" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "108778d38e20245713a2db936b332b9b538abcc3" -> (known after apply)
      ~ id                    = "hayas1:json-with-comments:47" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 47 -> (known after apply)
      ~ opened_at             = 1731847644 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847655 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "tfgh/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "5c04e8d30193b02717adec19caf6df406a8d8701" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "f16d3301f0e542caf1df8907e8781d2aa4a1e364" -> (known after apply)
      ~ id                    = "hayas1:tfgh:78" -> (known after apply)
      ~ labels                = [
          - "no-changes",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 78 -> (known after apply)
      ~ opened_at             = 1731847648 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847713 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/pull_request_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/release.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/workflows/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d0b3dbb3471c681e30c750be2eba289e1e17593e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "fd1ae488c58f609419267818f67342d80d7d9071" -> (known after apply)
      ~ id                    = "hayas1:tokei-toukei:28" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 28 -> (known after apply)
      ~ opened_at             = 1731847649 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847660 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 5 to add, 17 to change, 5 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"5e965b1b3c5d0e17781d3dd584c63a94f5048d8b6718e0ea00641ce1d7eb5464\"" -> "W/\"baad2f4c6a41eb53f5adf70dad4d0dfe456146c509e851a633198b4028207aca\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"39b5177be3311d5c4052df35754045337969e80d04edbfef2a6004de1d9f39ac\"" -> "W/\"3551717ee4e2ae0a37528c1f7f65e092ad53f3c2f5e80086ce24d49ae356dd4c\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"0371bf2238fcfe41a8072578cc48c707b2bfb505e0748e07532edbd0e88ed8d4\"" -> "W/\"e637aacdaf05600b267398122087848c04915778ac56bb2a611978568b199dc0\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"85241d2ecaca53c681bc9aba1612726b339ce9e5544ea4f3ace664f9ac9b56de\"" -> "W/\"c09e9c7bd59f00e80dd91705bac10d091cc7963fd6da10a3ddc13b3c04f19f05\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"e7550e5500dfa2a4c1fe804df1996ff004e48b20802877f13cd47af53278b357\"" -> "W/\"7bda20c1d67193f4e1ba49e83168679a82dafcd6d89e4c189c3b2633bed2801c\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":79,"Program":"tfcmt","SHA1":"fee154a9a517f7736e66d1d3cedd84b2b151956a","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->